[
  {
    "id": "flavurai",
    "title": "FlavurAI – AI Culinary Platform",
    "timeframe": "Aug 2025 – Present",
    "summary": "AI-powered platform that transforms short-form food videos into structured, high-fidelity written recipes.",
    "outcome": "Built a multimodal pipeline using GPT-4o and Whisper to extract ingredients, steps, and metadata from TikTok and Instagram videos.",
    "stack": ["GPT-4o", "Whisper", "React", "Vercel", "Modal", "Supabase, FastAPI"],
    "image": "",
    "links": {
        "demo": "https://veg-cooking.vercel.app/",
        "repo": "#"
    },
    "highlights": [
        "Designed a multimodal AI pipeline combining vision, audio transcription, and structured text generation",
        "Integrated TikTok and Meta Graph APIs for automated video ingestion",
        "Built a serverless backend using Modal + Supabase for scalable AI workloads",
        "Deployed a globally distributed React frontend on Vercel"
    ],
    "lessons": [
        "Multimodal systems require strict validation between vision, audio, and text outputs",
        "Latency and cost controls matter when chaining large models",
        "Product UX is just as important as model quality for adoption"
    ]
  },
  {
    "id": "ai-receptionist",
    "title": "AI Receptionist for Small Businesses",
    "timeframe": "2024 – Present",
    "summary": "Autonomous AI receptionist that handles calls, scheduling, and lead capture for small businesses.",
    "outcome": "Automated customer interactions and scheduling using LLM agents integrated with CRM workflows.",
    "stack": ["LLMs", "FastAPI", "Twilio", "Supabase", "Vercel"],
    "image": "",
    "links": {
        "demo": "#",
        "repo": "#"
    },
    "highlights": [
        "Built conversational agents capable of real-time call handling",
        "Integrated scheduling, lead capture, and CRM updates",
        "Designed for real-world business workflows and reliability"
    ],
    "lessons": [
        "AI agents must be constrained and observable to work in production",
        "Business context is as important as model intelligence"
    ]
  },
  {
    "id": "packbalance",
    "title": "PackBalance – Student Budgeting App",
    "timeframe": "2024",
    "summary": "Budgeting and expense-tracking app designed specifically for college students.",
    "outcome": "Delivered a clean, user-friendly financial tracking experience for students.",
    "stack": ["React", "Node.js", "PostgreSQL"],
    "image": "",
    "links": {
        "demo": "#",
        "repo": "#"
    },
    "highlights": [
        "Designed intuitive financial visualizations",
        "Focused on accessibility and student-specific budgeting needs"
    ],
    "lessons": [
        "Simplicity beats feature overload for consumer products"
    ]
  },
  {
    "id": "skin-cancer-ai",
    "title": "AI Skin Cancer Detection (Research)",
    "timeframe": "2023 – 2024",
    "summary": "CNN-based model for early-stage skin cancer detection developed in partnership with medical professionals.",
    "outcome": "ISEF award-winning project demonstrating real-world medical ML applications.",
    "stack": ["Python", "TensorFlow", "CNNs"],
    "image": "",
    "links": {
        "demo": "#",
        "repo": "#"
    },
    "highlights": [
        "Developed and trained a convolutional neural network for image-based diagnosis",
        "Worked alongside medical professionals to validate model outputs"
    ],
    "lessons": [
        "Model interpretability is critical in medical AI",
        "Accuracy alone is not enough without trust"
    ]
  }
]